[
  {
    "phrase": "Кукурузные хлопья - теперь без асбеста!",
    "signature": "©Неизвестный маркетолог"
  },
  {
    "phrase": "Собираюсь жить вечно, пока всё идёт нормально"
  },
  {
    "phrase": "Если ты будешь усердно работать по 8 часов в день, то обязательно станешь боссом и начнешь работать по 12"
  },
  {
    "phrase": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.",
    "signature": "©Стив Макконнелл"
  },
  {
    "phrase": "Не волнуйтесь, если что-то не работает. Если бы всё работало, вас бы уволили.",
    "signature": "Mosher’s Law of Software Engineering"
  },
  {
    "phrase": "Болтовня ничего не стоит. Покажите мне код.",
    "signature": "Linus Torvalds"
  },
  {
    "phrase": "Изучение программирования имеет такое же отношение к проектированию интерактивных систем, как обучение слепой печати к написанию стихов.",
    "signature": "Ted Nelson"
  },
  {
    "phrase": "Иногда лучше остаться спать дома в понедельник, чем провести всю неделю отлаживая написанный в понедельник код.",
    "signature": "Christopher Thompson"
  },
  {
    "phrase": "Измерять продуктивность программирования подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
    "signature": "Bill Gates"
  },
  {
    "phrase": "Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать.",
    "signature": "Brian W. Kernighan"
  },
  {
    "phrase": "Люди считают, что программирование — это наука избранных, но в реальности все наоборот — просто много людей создают программы, которые используют чужие программы, как-будто строя стену из маленьких кирпичиков.",
    "signature": "Donald Knuth"
  },
  {
    "phrase": "Сначала учите науку программирования и всю теорию. Далее выработаете свой программистский стиль. Затем забудьте все и просто программируйте.",
    "signature": "George Carrette"
  },
  {
    "phrase": "Многие из вас знакомы с достоинствами программиста. Их всего три, и разумеется это: лень, нетерпеливость и гордыня.",
    "signature": "Larry Wall"
  },
  {
    "phrase": "Трудность работы с програмистом заключается в том, что вы не можете понять что он делает до тех пор пока не стало слишком поздно.",
    "signature": "Seymour Cray"
  },
  {
    "phrase": "Итерация свойственна человеку, рекурсия божественна.",
    "signature": "L. Peter Deutsch"
  },
  {
    "phrase": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
    "signature": "Linus Torvalds"
  },
  {
    "phrase": "Есть два способа создания дизайна программы. Один из них, это сделать его настолько простым, что в нем, очевидно, не будет недостатков. Другой способ — сделать его настолько запутанным, что в нем не будет очевидных недостатков.",
    "signature": "C.A. R. Hoare"
  }
]